Repository: pingfangx/BlogX
Catalog: CodeFarmer/python/usage/2393/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Wait for command to complete, then return the returncode attribute.
zh_cn: 等待命令完成，然后返回 returncode 属性。

source: Wait for command to complete.
zh_cn: 等待命令完成。

source: Warning
zh_cn: 警告

source: When shell=False, executable replaces the program to execute specified by args.
zh_cn: 当 shell=False 时，executable 会替换 args 指定的程序。

source: When used, the internal Popen object is automatically created with stdin=PIPE, and the stdin argument may not be used as well.
zh_cn: 使用时，内部 Popen 对象会自动使用 stdin=PIPE 和 stdin 参数也可能不会被使用。

source: With the default settings of None, no redirection will occur; the child’s file handles will be inherited from the parent.
zh_cn: 使用默认设置 None，不会发生重定向;孩子的文件句柄将从父类继承。

source: You can now use run() in many cases, but lots of existing code calls these functions.
zh_cn: 您现在可以在很多情况下使用 run()，但大量现有代码调用这些函数。

source: You do not need shell=True to run a batch file or console-based executable.
zh_cn: 您不需要 shell=True 来运行批处理文件或基于控制台的可执行文件。

source: any other positive value means use a buffer of approximately that size
zh_cn: 任何其他正值意味着使用大约那个大小的缓冲区

source: negative bufsize (the default) means the system default of io.DEFAULT_BUFFER_SIZE will be used.
zh_cn: 负的 bufsize(默认值)表示将使用 io.DEFAULT_BUFFER_SIZE 的系统默认值。
